IDEA Open Model
ReportSettings Properties
The ReportSettings type exposes the following members.
Properties
Name | Description
CultureName
 The name of the required culture of the report
Formulas
 Indicates if formulas are in report
PlatesDrawings
 Indicates, whether generate drawing of plates.
ReportType
 Gets or sets the type of report.
ResultsPictures
 Indicates, whether generate pictures of results.
SymbolExplanations
 Indicates, whether generate explanations to report.
TheoreticalBackground
 Indicates, whether generate theoretical background.
Views
 Indicates, whether generate views (XY, XZ, YZ) into report.
Top
See Also
Reference
ReportSettings Class
IdeaRS.OpenModel.Connection Namespace